# 7/30(土)  第5章ACLの実験レポート
## ACLの概要

## ・*標準ACL*  
→パケットの**送信元IPアドレス**をチェックする。標準ACLには**番号付き標準ACL**と**名前付き標準ACL**が存在する。  

## ・*拡張ACL*
→パケットの**送信元IPアドレス**、**宛先IPアドレス**、**プロトコル番号**、**送信元ポート番号**、**宛先ポート番号**をチェックする。拡張ACLには**番号付き拡張ACL**と**名前付き拡張ACL**が存在する。  

**番号付き標準ACL**と**番号付き拡張ACL**は番号によって識別され、**名前付き標準ACL**と**名前付き拡張ACL**は名前によって識別される。  
標準ACLの番号付きACLで使われる番号は1〜99である。  
拡張ACLの番号付きACLで使われる番号は100〜199である。  
**番号付きACL**と**名前付きACL**は同様に扱うことができるため、今回の実験では**番号付きACL**のみを扱った。

## **標準ACL** 実験環境
![今日の実験内容(標準ACL)](/images/20220730acl/StandardExperimentContent.jpg)

- 教科書264ページの図5.1.8を再現した実験環境を構築した。(構築時、ファイアウォールが働いていることに気づくのに1時間ほどかかった)
- PC→192.168.0.10/24
- 社外PC→192.168.100.8/24
- Webサーバ→172.16.0.101/24
- FE8→192.168.0.1/24
- FE7(vlan100)→192.168.100.1/24
- GE0→172.16.0.10/24

## 実験内容
192.168.0.0/24のネットワークからWebサーバへの通信を拒否し、それ以外のネットワークからの通信は許可する内容のACLをGE0のアウトバウンドに適用する。  
192.168.0.0/24と192.168.100.0/24のネットワークからWebサーバへの通信はそれぞれどうなるのか。
## 実験方法
### 1. 標準ACLを作成する。
```html
Router1(config)#access-list 1 deny 192.168.0.0 0.0.0.255
Router1(config)#access-list 1 permit any
```

### 2. インターフェイスへ適用する
```html
Router1(config)#interface　GigaEthernet 0
Router(config-if)#ip access-group 1 out
```

## 結果
192.168.0.0/24のネットワークからWebサーバへの通信が拒否された。(pingが通らなくなった)  
192.168.100.0/24のネットワークからWebサーバへの通信は許可されていた。(pingが通った)

## 標準ACLの確認(#show access-lists)
```html
Standard IP access list 1
    10 deny 192.168.0.0 0.0.0.255
    20 permit any
```
ACL番号1に192.168.0.0/24のネットワークからの通信を拒否し、それ以外のネットワークからの通信を許可する内容のACLが定義できていることが分かる。

## インターフェイスの確認(#show ip interface GigabitEthernet 0)
```html
(省略)
Outgoing access list is 1
Inbound access list is not set
(省略)
```

## running-configからの確認(#show running-config)
```html
(省略)
interface GigabitEthernet 0
  ip address 172.16.0.10 255.255.255.0
  ip access-group 1 out
  deplex auto
  speed auto
!
(省略)
access-list 1 deny 192.168.0.0 0.0.0.255
access-list 1 permit any
(省略)
```
宛先に最も近いインターフェイスであるGigabitEthernet0に対して、ACL番号1をアウトバウンドで適用できていることが分かる。

## 標準ACLの削除
```html
Router1(config)#no access-list 1
```
もしくは
```html
Router1(config)#ip access-list standard 1
Router1(config-std-nacl)#no 10
Router1(config-std-nacl)#no 20
```
前者ではACL番号1のACLの内容を全て削除していることが分かり、後者では標準ACLコンフィギュレーションモードに入り、シーケンス番号を指定することで特定の行を削除できることが分かった。

## **拡張ACL** 実験環境
![今日の実験内容(拡張ACL)](/images/20220730acl/ExtendExperimentContent.jpg)

- 教科書264ページの図5.1.8の実験環境を拡張ACLで再現した。
- PC→192.168.0.10/24
- 社外PC→192.168.100.8/24
- Webサーバ→172.16.0.101/24
- FE8→192.168.0.1/24
- FE7(vlan100)→192.168.100.1/24
- GE0→172.16.0.10/24

## 実験内容
192.168.0.0/24のネットワークからWebサーバへの通信のうち、icmpとtcpのポート番号2022のみの通信を許可するACLをFE8のインバウンドに、192.168.100.0/24のネットワークからWebサーバへの通信のうち、tcpのポート番号80のみの通信を許可するACLをFE7のインバウンドに適用し、それ以外の通信は拒否するACLを、なるべく記述を減らして記述する。  
192.168.0.0/24と192.168.100.0/24のネットワークからWebサーバへの通信はそれぞれどうなるのか。

## 実験方法
### 1. 拡張ACLを作成する。
```html
Router1(config)#access-list 100 permit icmp 192.168.0.0 0.0.0.255 172.16.0.101 0.0.0.0
Router1(config)#access-list 100 permit tcp 192.168.0.0 0.0.0.255 172.16.0.101 0.0.0.0 eq 2022
Router1(config)#access-list 150 permit tcp 192.168.100.0 0.0.0.255 172.16.0.101 0.0.0.0 eq 80
```

### 2. インターフェイスへ適用する
```html
Router1(config)#interface FastEthernet 8
Router(config-if)#ip access-group 100 in
Router(config-if)#exit
Router(config)#interface vlan 100
Router(config-if)#ip access-group 150 in
```

## 結果
192.168.0.0/24のネットワークからWebサーバへのicmp(ping)の通信が許可され、tcpのポート番号2022の通信が許可されていた。また、tcpのポート番号80の通信は拒否された。  
192.168.100.0/24のネットワークからWebサーバへのtcpのポート番号80の通信が許可されていた。icmp(ping)の通信とtcpのポート番号2022の通信は拒否された。

## 拡張ACLの確認(#show access-lists)
```html
Extended IP access list 100
    10 permit icmp 192.168.0.0 0.0.0.255 172.16.0.0 0.0.0.255
    20 permit tcp 192.168.0.0 0.0.0.255 172.16.0.0 0.0.0.255 eq 2022
Extended IP access list 150
    10 permit tcp 192.168.100.0 0.0.0.255 172.16.0.0 0.0.0.255 eq www
```
ACL番号100に192.168.0.0/24のネットワークからのicmpの通信とtcpのポート番号2022の通信を許可する内容のACLが定義できていることが分かり、ACL番号150に192.168.100.0/24のネットワークからのtcpのポート番号80の通信を許可する内容のACLが定義できていることが分かる。  
それ以外のネットワークの通信に関しては記述していないが、ACLは最後に暗黙的にdenyが入るため、全ての通信が拒否される。

## インターフェイスの確認(#show ip interface FastEthernet 8)
```html
(省略)
Outgoing access list is not set
Inbound access list is 100
(省略)
```

## インターフェイスの確認(#show ip interface vlan 100)
```html
(省略)
Outgoing access list is not set
Inbound access list is not set
(省略)
```

## running-configからの確認(#show running-config)
```html
(省略)
interface FastEthernet 8
  ip address 192.168.0.1 255.255.255.0
  ip access-group 100 in
  deplex auto
  speed auto
!
interface Vlan100
  mac-address ~.~.~
  ip address 192.168.100.1 255.255.255.0
  ip access-group 150 in
!
(省略)
access-list 100 permit icmp 192.168.0.0 0.0.0.255 172.16.0.0 0.0.0.255
access-list 100 permit tcp 192.168.0.0 0.0.0.255 172.16.0.0 0.0.0.255 eq 2022
access-list 150 permit tcp 192.168.100.0 0.0.0.255 172.16.0.0 0.0.0.255 eq www
(省略)
```
192.168.0.0/24の送信元に最も近いインターフェイスであるFastEthernet8に対してACL番号100をインバウンドで、192.168.100.0/24の送信元に最も近いインターフェイスであるFastEthernet7(vlan100)に対してACL番号150をインバウンドで適用できていることが分かる。

## 拡張ACLの削除
```html
Router1(config)#no access-list 100
Router1(config)#no access-list 150
```
もしくは
```html
Router1(config)#ip access-list extended 100
Router1(config-ext-nacl)#no 10
Router1(config-ext-nacl)#no 20
Router1(config-ext-nacl)#exit
Router1(config)#ip access-list extended 150
Router1(config-ext-nacl)#no 10
```

## ※ACLを作成する際の注意点
・ACLには最後に暗黙的にdenyが入るため、ネットワークからの通信を許可する記述を明示しなければならない。  
・ACLは1行目から順に検証され、該当する行があった場合にはそこで検証が止まるため、ACLを記述する順番には気を付けなければならない。

## ※インターフェイスへ適用する際の注意点
・標準ACLは送信元IPアドレスでしか検証することができないため、**宛先**に最も近いインターフェイスに対して適用する。  
・拡張ACLは送信元IPアドレスだけでなく宛先IPアドレスも指定できるため、**送信元**に最も近いインターフェイスに対して適用する。  
・インバウンドとアウトバウンドの記述を間違えないようにしなければならない。

## ※インバウンドで設定した場合とアウトバウンドで設定した場合の違い
インバウンドで設定した場合は、**パケット受信時**にACLを確認し、アウトバウンドで設定した場合は、**出力インターフェイスから送信する前**にACLを確認し、通信を拒否するか許可するかを確定する。  
標準ACLは送信元IPアドレスしかチェックすることができないためアウトバウンドに設定し、拡張ACLは送信元IPアドレスだけでなく宛先IPアドレスなどもチェックすることができるためインバウンドに設定するのが基本である。

## おまけ
```html
Standard IP access list 1
    10 deny 192.168.0.0 0.0.0.255
    20 permit any
```
このようにACLが記述されている状態で、シーケンス番号10を削除し、その後もう一度*Router1(config)#access-list 1 deny 192.168.0.0 0.0.0.255*を実行すると、
```html
Standard IP access list 1
    20 permit any
    30 deny 192.168.0.0 0.0.0.255
```
というように順番が入れ替わってしまい、想定する動作とは異なる動作をしてしまうため、注意が必要である。

# まとめ
- ACLはルータを通過する通信を制御する際に使用されるものである。
- ACLには標準ACLと拡張ACLの2種類があり、それぞれ番号付きACLと名前付きACLに分類される。
- ACLを適用する順序は、①.ACLを作成する。②.インターフェイスに適用する。である。
- ACL作成する際、ACLを記述する順番には気を付けなければならない。
- インターフェイスに適用する際、標準ACLは宛先に最も近いインターフェイスに対して適用する。
- インターフェイスに適用する際、拡張ACLは送信元に最も近いインターフェイスに対して適用する。
- インターフェイスに適用する際、インバウンドとアウトバウンドの記述を間違えないようにしなければならない。

## Packet Tracer
[ACL.pkt](/pkt/ACL.pkt)